Here is my test.
Note: Template has an 8gb disk

```hcl
resource "proxmox_vm_qemu" "lab_servers" {
  name = "test-vm-0.home.local"

  target_node = var.proxmox_host
  clone       = var.template_name

  vmid = 666

  agent    = 1
  os_type  = "cloud-init"
  cores    = 2
  sockets  = 1
  cpu      = "host"
  memory   = 2048
  scsihw   = "virtio-scsi-pci"
  bootdisk = "scsi0"

  disks {
    scsi {
      scsi0 {
        disk {
          size       = 18
          storage    = "vg_nvme"
          emulatessd = true
        }
      }
    }
  }

  network {
    model  = "virtio"
    bridge = "vmbr0"
  }

  lifecycle {
    ignore_changes = [network]
  }

  ipconfig0 = "ip=dhcp"

  sshkeys = <<EOF
  ${var.ssh_key}
  EOF

}
```

apply

```
  # proxmox_vm_qemu.lab_servers will be created
  + resource "proxmox_vm_qemu" "lab_servers" {
      + additional_wait           = 5
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = "scsi0"
      + clone                     = "RL92-Template"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp"
      + kvm                       = true
      + linked_vmid               = (known after apply)
      + memory                    = 2048
      + name                      = "test-vm-0.home.local"
      + nameserver                = (known after apply)
      + onboot                    = false
      + oncreate                  = false
      + os_type                   = "cloud-init"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDJEvp+CSY962e6pqAnmANY56tiL8q7Xvy6C8sseAr1obcW4kct2/KbAi11d/Wseav+vS5B08euHl/wfg0wQE63G+BL7W1vVZhjm06cB4GFayE2UDuBiQpg16R6f+tUAHejz4J3XgWBrb3Pdxh4h/E3Zt6DLaodtUb+jZy2eUc1M7AidAUCKOGCZhdK8626E4tSnVD1ySlZSkrTXSX/p0ESn4ww123uv6QWsOOigUuImL62evtXg+6ve9Zx8gxIOGxQn0FZAR5qsxQHnF0uumM9kdhoasdw+FNEJ8ynAKmmkWfTKooZ6HCXi0X8fFAeh5MT/TyLlSPbTNIKBMdlyLI351x5fwyMwER18hCD/ljLLUaL36FWqn282Bkt8qS8rJAdC41Q/D4E0WcO4WW7FhX5bF73hl3bL5RVKoRDfxoiMugfBdU/INKYuyMU2YGVaaLQW7VecD3kXXZcvr40DAqAZ0bPPq5y3o0efOO7R/Xbdoq17o5x+GB9kdfX5I5s=
        EOT
      + tablet                    = true
      + target_node               = "artemis"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vm_state                  = "running"
      + vmid                      = 666

      + disks {
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + emulatessd           = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = 18
                      + storage              = "vg_nvme"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
proxmox_vm_qemu.lab_servers: Creating...
proxmox_vm_qemu.lab_servers: Still creating... [10s elapsed]
proxmox_vm_qemu.lab_servers: Still creating... [20s elapsed]
proxmox_vm_qemu.lab_servers: Still creating... [30s elapsed]
proxmox_vm_qemu.lab_servers: Still creating... [40s elapsed]
proxmox_vm_qemu.lab_servers: Creation complete after 50s [id=artemis/qemu/666]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Machine booted fine

If I run terrafom plan again I get this

```
proxmox_vm_qemu.lab_servers: Refreshing state... [id=artemis/qemu/666]

Terraform used the selected providers to generate the following execution plan. Resource actions
are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_vm_qemu.lab_servers will be updated in-place
  ~ resource "proxmox_vm_qemu" "lab_servers" {
      + bootdisk                  = "scsi0"
      - desc                      = "Rocky Linux 9.2 Template" -> null
        id                        = "artemis/qemu/666"
        name                      = "test-vm-0.home.local"
      - qemu_os                   = "l26" -> null
        # (38 unchanged attributes hidden)

      ~ disks {
          - ide {
            }
          ~ scsi {
              ~ scsi0 {
                  ~ disk {
                      ~ backup               = false -> true
                      ~ emulatessd           = false -> true
                      + format               = "raw"
                        id                   = 0
                      - replicate            = true -> null
                      ~ size                 = 8 -> 18
                        # (15 unchanged attributes hidden)
                    }
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take
exactly these actions if you run "terraform apply" now.
```

apply returns error

```
Plan: 0 to add, 1 to change, 0 to destroy.
proxmox_vm_qemu.lab_servers: Modifying... [id=artemis/qemu/666]
╷
│ Error: 500 you can't move to the same storage with same format
│
│   with proxmox_vm_qemu.lab_servers,
│   on main.tf line 1, in resource "proxmox_vm_qemu" "lab_servers":
│    1: resource "proxmox_vm_qemu" "lab_servers" {
│
╵
```